# Homework Assignment 3

In [1]:
import numpy as np
import pandas as pd

### Question 1

The `fifa.csv` data contains a variety of information on nearly 9,000 soccer players. Load the data and assign it to the variable `df`. Then collect summary statistics from all columns using the `.describe()` method.

In [161]:
df = pd.read_csv('fifa.csv')
df.describe(include = 'all')

,id,name,rating,position,height,foot,rare,pace,shooting,passing,dribbling,defending,heading,diving,handling,kicking,reflexes,speed,positioning
count,8847.000000,8847,8847.000000,8847,8847.000000,8847,8847.000000,7917.000000,7917.000000,7917.000000,7917.000000,7917.000000,7917.000000,930.000000,930.000000,930.000000,930.000000,930.000000,930.000000
unique,NaN,8678,NaN,4,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Henrique,NaN,M,NaN,Right,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,5,NaN,3041,NaN,6762,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,152337.538035,NaN,66.680457,NaN,181.750424,NaN,0.353114,67.934066,55.054440,58.845522,61.193887,60.339523,63.743337,67.351613,64.739785,63.067742,68.865591,48.212903,64.955914
std,54506.606056,NaN,7.146679,NaN,6.454356,NaN,0.477965,11.169316,13.136116,10.962049,12.255261,10.622997,8.982680,8.311224,8.073867,8.653150,8.546599,10.330171,8.854231
min,2.000000,NaN,40.000000,NaN,158.000000,NaN,0.000000,24.000000,12.000000,13.000000,19.000000,26.000000,22.000000,30.000000,39.000000,30.000000,32.000000,14.000000,37.000000
25%,140001.500000,NaN,62.000000,NaN,178.000000,NaN,0.000000,62.000000,47.000000,52.000000,54.000000,52.000000,58.000000,62.000000,60.000000,57.000000,63.000000,42.000000,59.000000
50%,171578.000000,NaN,66.000000,NaN,182.000000,NaN,0.000000,69.000000,57.000000,60.000000,63.000000,61.000000,64.000000,67.000000,65.000000,63.000000,69.000000,50.000000,65.000000
75%,189185.000000,NaN,72.000000,NaN,186.000000,NaN,1.000000,75.000000,65.000000,66.000000,70.000000,68.000000,70.000000,73.000000,70.000000,69.000000,74.000000,56.000000,71.000000
max,205583.000000,NaN,94.000000,NaN,208.000000,NaN,1.000000,96.000000,90.000000,92.000000,97.000000,89.000000,91.000000,91.000000,86.000000,94.000000,93.000000,73.000000,91.000000

### Question 2

Find the player (or players) in the data set with the longest `name`. Use a list comprehension to create a new list to hold the lengths of each name, sort the list, then slice the DataFrame to find all values where `name` has the same length as the largest value. (**Note:** recall that lists use zero indexing, so `[0]` will access the first element in a list and `[-1]` will access the last element in the list.)

In [58]:
lengths = df.name.str.len()
lengths = lengths.tolist()
lengths.sort()
lengths[-1]

df.loc[(df.name.str.len()) == lengths[-1]]

,id,name,rating,position,height,foot,rare,pace,shooting,passing,dribbling,defending,heading,diving,handling,kicking,reflexes,speed,positioning
4187,178386,Cesare Gianf. Rickler Del Mare,65,D,196,Right,1,53.0,33.0,43.0,35.0,71.0,69.0,NaN,NaN,NaN,NaN,NaN,NaN

### Question 3

Use `groupby` to group the `rating` variable by the player's `position`. Which `position` has the highest mean `rating`? Remember to chain `.sort_values(ascending=False)` to sort the resulting data on their values and not alphabetically by position name.

In [136]:
A = df['rating'].groupby(df['position']).mean().sort_values(ascending = False)

A[0:1]

position
A    67.260807
Name: rating, dtype: float64

### Question 4

Create a Pandas `pivot_table` to count the number of players in each `position`. Use `rating` as the aggregation value again, but this time pass `aggfunc='count'` to report the number of players. Which `position` has the most players? Remember to sort the values in descending order, and include `by='rating'` to sort on the counted data.

In [167]:
A = pd.pivot_table(df, index = 'position', values = 'rating', aggfunc = 'count')
A = A.sort_values(by = 'rating', ascending = False)
A[0:1]

          rating
position
M           3041

### Question 5

Create a Pandas `crosstab` to compare the number of players in each `position` by `foot`. Set `normalize='all'` and `margins=True` to view the data as a percent of the total. What combination of footedness and position is the most rare in our data?

In [145]:
pd.crosstab(df['position'], df['foot'], normalize = 'all', margins = True)

# I do not understand what it is meant by the combination that is the most rare. 

# It could be D if the question means the highests number of left footed players.

foot          Left     Right       All
position
A         0.041596  0.193738  0.235334
D         0.103425  0.212388  0.315813
GK        0.011077  0.094043  0.105120
M         0.079575  0.264157  0.343732
All       0.235673  0.764327  1.000000

### Question 6

Now we will look at some Major League Soccer (MLS) data in the U.S. Load the `'mls_salaries17.csv'` file and aggregate the data by `position` to count how many players in the MLS play at each position. Remember to sort the values from largest to smallest. Is the same position in Question 4 the largest in the MLS too?

In [268]:
df2 = pd.read_csv('mls_salaries17.csv')

A = df['position'].groupby(df['position']).count().sort_values(ascending = False)
A[0:1]

# Yes, it is.

position
M    3041
Name: position, dtype: int64

### Question 7

Group the MLS `base_salary` data by `club` to find the club with the highest average (`mean`) salary. Group the MLS salary data again to find the club with the highest `max` salary. Is there a difference between the two? Remember to sort the values from largest to smallest.

In [170]:
A = df2['base_salary'].groupby(df2['club']).mean().sort_values(ascending=False)
A[0:1]

club
Toronto FC    718893.642857
Name: base_salary, dtype: float64

In [233]:
B = pd.pivot_table(df2, index = 'club', values = 'base_salary', aggfunc = 'max')
B = B.sort_values(by = 'base_salary', ascending = False)
B[0:1]


#Yes, there is a difference.

              base_salary
club
Orlando City    6660000.0

### Question 8

Use Pandas indexing to find the row with the highest-paid player using `base_salary`. How far above the average salary is his `base_salary`?

In [263]:
df2['base_salary'].idxmax()

401

In [266]:
B = df2.mean(0)

C = (df2.iloc[401] - B)
print(C)

base_salary                6.36302e+06
club                               NaN
first_name                         NaN
guaranteed_compensation    6.84136e+06
id                                 NaN
last_name                          NaN
position                           NaN
dtype: object

### Question 9

Load the MLS team rankings data from `'mls_rankings17.csv'`. Print the `shape` of this data set and of the `'mls_salary17.csv'`. Merge the two DataFrames together on `id` and `club` and print the `shape` of the resulting dataframe. The number of columns from the merged DataFrame should be two less than the sum of the columns of both to account for the merge keys that are the same in both.

In [273]:
df3 = pd.read_csv('mls_rankings17.csv')
print(df3.shape)

df4 = pd.merge(df2,df3, left_on = ['id', 'club'], right_on = ['id', 'club'])
print(df4.shape)

(22, 11)
(616, 16)

### Question 10

Use `np.where()` to add an indicator variable identifying teams in the top 10 (where `ranking` is greater than or equal to 10.) Call this new variable `top10`. Create a pivot table using the combined MLS data. Use `'top10'` as the index value, `position` as the column value, and `base_salary` to fill the table. Aggregate using the `mean`. Do the higher-performing clubs tend to pay their players more or less than the lower-performing clubs?

In [295]:
df4['top10'] = np.where(df4['ranking']<= 10, 'yes', 'no')

In [301]:
A = pd.pivot_table(df4, index = 'top10', columns = 'position', values = 'base_salary', aggfunc = 'mean', margins =True)
A

#The higher performing clubs tend to pay their players more than the lower-performing clubs.

position,A,D,GK,M,All
top10,,,,,
no,311477.661212,164251.849252,170119.644722,308852.455285,247727.809398
yes,698952.711600,164459.559565,117117.458621,417861.343628,354551.595739
All,478492.769138,164347.876131,146472.515538,361047.389110,296977.736867